Tekla Open API Reference for Tekla Structures 2025
TaskDependency Properties
The TaskDependency type exposes the following members.
Properties
Name | Description
DependencyType
 The type of the task dependency.
Identifier
 The identifier of the object.
 (Inherited from Object.)
IsUpToDate
Gets if the object does not have a modification which is not shared.
 (Inherited from ModelObject.)
Lag
 The lag of the task dependency represented in whole hours.
Local
 The locality indicates if the dependency was created in Tekla Structures and Task Manager or imported.
ModificationTime
Gets latest time of the object was modified or created.
 (Inherited from ModelObject.)
Primary
 The primary task of the task dependency.
Secondary
 The secondary task of the task dependency.
Top
See Also
Reference
TaskDependency Class
Tekla.Structures.Model Namespace